"""
1. 포도주 잔을 선택하면 그 잔에 들어있는 포도주는 모두 마셔야한다, 마신 후에는 원래 위치에 다시 놓아야 한다.
2. 연속으로 놓여 있는 3잔을 모두 마실 수는 없다.
-> 가장 많은 양의 포도주를 마실 수 있는 프로그램 작성
"""

import sys
input = sys.stdin.readline

n = int(input())

# 다루기 편하도록 처음 인덱스에 더미 값 0 넣어줌 -> 1부터 시작하도록
wines = [0]
for _ in range(n):
    wine = int(input())
    wines.append(wine)

dp = [0] * (n+1)
# 첫번 째 포도주의 위치에서 뒤를 봤을때 선택할 수 있는 경우의 수
dp[1] = wines[1]

# 두번 째 포도주의 위치에서 뒤를 봤을때 선택할 수 있는 경우의 수
if n > 1:
    dp[2] = wines[1] + wines[2]
    
# 예제 입력 가정 -> 0, 6, 10, 13, 9, 8, 1
for i in range(3, n+1):
    # 세번 째 포도주 경우의 수 -> 6 + 13 / 6 + 10 / 0 + 10 + 13
    # 네번 째 포도주 경우의 수 -> 10 + 9 / 23 / 6 + 13 + 9
    # 다섯번 째 포도주 경우의 수 -> 23 + 8 / 28 / 16 + 9 + 8 
    dp[i] = max(dp[i-2] + wines[i], dp[i-1], dp[i-3] + wines[i-1] + wines[i])
    
print(dp[-1])